Repository: 84000/data-translation-memory
Catalog: toh112-v3.tmx
Source language: bo
Languages: en

source: །རིགས་ཀྱི་བུ་དེ་ནས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིན་པོ་ཆེའི་སྙིང་པོས་རྒྱལ་པོ་རྩིབས་ཀྱི་མུ་ཁྱུད་ལ་ལེགས་སོ་ཞེས་བྱ་བ་བྱིན་ཏེ། རྒྱལ་པོ་ཆེན་པོ་ལེགས་སོ་ལེགས་སོ།
en: Then, noble son, the tathāgata arhat samyaksam­buddha Ratnagarbha congratulated King Araṇemin, saying, ‘Excellent, great king, excellent!

source: །རྒྱལ་པོ་ཆེན་པོ་ཁྱོད་ཀྱིས་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པ་ཡོངས་སུ་བཟུང་བ་ནི་ཁྱོད་ཀྱི་སྨོན་ལམ་ཟབ་བོ།
en: Great king, your prayer to acquire a pure buddha realm is profound. “ ‘

source: །རྒྱལ་པོ་ཆེན་པོ་ལྟོས་ཤིག་དང་།
en: Great king, look!

source: ནུབ་ཕྱོགས་ལོགས་སུ་སངས་རྒྱས་ཀྱི་ཞིང་བྱེ་བ་ཕྲག་འབུམ་འདས་པ་ན་འཇིག་རྟེན་གྱི་ཁམས་དབང་པོ་ལྟར་ཤིན་ཏུ་མཛེས་པ་ཞེས་བྱ་བ་ཞིག་ཡོད་དེ།
en: In the west, beyond a trillion buddha realms, there is a world known as Indrasuvirājitā.

source: དེ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དབང་པོའི་དབྱངས་ཀྱི་དབང་ཕྱུག་རྒྱལ་པོ་ཞེས་བྱ་བ་བཞུགས་ཏེ། འཚོ་ཞིང་གཞེས་ལ་སེམས་ཅན་ཡོངས་སུ་དག་པ་རྣམས་ལ་ཆོས་ཀྱང་སྟོན་ཏོ།
en: The tathāgata arhat samyaksam­buddha named Indra­ghoṣeśvara­rāja is present, exists, and lives there, teaching the Dharma to pure beings. “ ‘

source: །སངས་རྒྱས་ཀྱི་ཞིང་དེ་ན་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་རྣམས་འབྱུང་བ་གདགས་སུ་ཡང་མེད་ཅིང་དེ་ན་ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཀྱི་གཏམ་བརྗོད་པ་ཡང་མེད་དོ།
en: In that pure realm there are not even the words śrāvaka or pratyekabuddha.

source: །དེ་ན་ཐེག་པ་ཆེན་པོའི་གཏམ་འབའ་ཞིག་བརྗོད་དོ།
en: Only the Mahāyāna is taught there.

source: །དེ་ན་སེམས་ཅན་རྣམས་ནི་ཐམས་ཅད་ཀྱང་རྫུས་ཏེ་སྐྱེས་པ་ཤ་སྟག་གོ།
en: There, all beings are spontaneously born.

source: །དེ་ན་བུད་མེད་ཀྱི་མིང་ཡང་མི་གྲག་སྟེ།
en: There is not even the word woman there.

source: སངས་རྒྱས་ཀྱི་ཞིང་དེ་ན་ཇི་ལྟར་རྒྱལ་པོ་ཆེན་པོ་སངས་རྒྱས་ཀྱི་ཞིང་གི་ཡོན་ཏན་བཀོད་པའི་སྨོན་ལམ་དཔག་ཏུ་མེད་པ་བཏབ་ཅིང་འདུལ་བའི་སེམས་ཅན་བསམ་པ་དཔག་ཏུ་མེད་པ་དག་ཡོངས་སུ་བཟུང་བ་དེ་ལྟ་བུའི་ཡོན་ཏན་ཐམས་ཅད་ཡོད་དོ།
en: Great king, all the qualities that are in that buddha realm are just like the entire array of immeasurable buddha-realm qualities that you have prayed for, and the disciples there are beings with immeasurably pure motivation. “ ‘

source: །རྒྱལ་པོ་ཆེན་པོ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དབང་པོའི་དབྱངས་ཀྱི་དབང་ཕྱུག་རྒྱལ་པོ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ཤིང་དེར་དམ་པའི་ཆོས་ནུབ་ནས་བར་གྱི་བསྐལ་པ་དྲུག་ཅུ་འདས་པ་ན་འཇིག་རྟེན་གྱི་ཁམས་དེ་ནི་ལྷུན་པོའི་འོད་ཅེས་བྱ་བར་འགྱུར་རོ།
en: Great king, after the tathāgata arhat samyaksam­buddha Indra­ghoṣeśvara­rāja has passed into parinirvāṇa, his Dharma will come to an end, and after sixty intermediate eons have passed, that realm will be named Meruprabhā.

source: །དེར་ཡང་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་བློ་གྲོས་བསམ་ཡས་ཡོན་ཏན་རྒྱལ་པོ་ཞེས་བྱ་བ་འབྱུང་བར་འགྱུར་ཏེ།
en: In that realm will appear the tathāgata arhat samyaksam­buddha named Acintyamatiguṇa­rāja.

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དབང་པོའི་དབྱངས་ཀྱི་དབང་ཕྱུག་རྒྱལ་པོའི་འཇིག་རྟེན་གྱི་ཁམས་དབང་པོ་ལྟར་ཤིན་ཏུ་མཛེས་པའི་སངས་རྒྱས་ཀྱི་ཞིང་གི་ཡོན་ཏན་བཀོད་པ་ཅི་འདྲ་བར་དེ་བཞིན་གཤེགས་པ་བློ་གྲོས་བསམ་ཡས་ཡོན་ཏན་རྒྱལ་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ལྷུན་པོའི་འོད་ཀྱི་ཡོན་ཏན་བཀོད་པ་ཡང་དེ་དང་འདྲ་བར་འགྱུར་རོ།
en: The array of qualities in Meruprabhā, the realm of the tathāgata arhat samyaksam­buddha Acintyamatiguṇa­rāja, will be the same as the array of qualities in the tathāgata arhat samyaksam­buddha Indra­ghoṣeśvara­rāja’s buddha realm. “ ‘

source: །དེ་བཞིན་གཤེགས་པ་བློ་གྲོས་བསམ་ཡས་ཡོན་ཏན་རྒྱལ་པོ་དེའི་ཚེའི་ཚད་ནི་བར་གྱི་བསྐལ་པ་དྲུག་ཅུར་འགྱུར་རོ།
en: The tathāgata arhat samyaksam­buddha Acintyamatiguṇa­rāja’s lifespan will be sixty intermediate eons.

source: །གང་གི་ཚེ་དེ་བཞིན་གཤེགས་པ་བློ་གྲོས་བསམ་ཡས་ཡོན་ཏན་རྒྱལ་པོ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་ན། དེའི་དམ་པའི་ཆོས་ནི་བར་གྱི་བསྐལ་པ་བཅུ་དྲུག་ཏུ་གནས་པར་འགྱུར་ཏེ།
en: When the tathāgata arhat samyaksam­buddha Acintyamatiguṇa­rāja passes into parinirvāṇa, his Dharma will remain for sixteen intermediate eons.

source: དེའི་དམ་པའི་ཆོས་ནུབ་ནས་བར་གྱི་བསྐལ་པ་སྟོང་འདས་པ་ན་འཇིག་རྟེན་གྱི་ཁམས་དེ་ནི་རྣམ་པར་དགའ་བ་ཞེས་བྱ་བར་འགྱུར་རོ།
en: One thousand intermediate eons after his Dharma has come to an end, that realm will have the name Virati.

source: །དེར་ཡང་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་ཟེར་ཞེས་བྱ་བ་འབྱུང་བར་འགྱུར་ཏེ།
en: In that realm will appear the tathāgata arhat samyaksam­buddha named Raśmi.

source: དེ་ཡང་སྔ་མ་དང་ཚེའི་ཚད་མཉམ་པ་དང་། འཇིག་རྟེན་གྱི་ཁམས་མཚུངས་པར་འགྱུར་བར་སྦྱར་རོ།
en: His lifespan will be the same as the former buddha, and his realm will be the same.

source: །དེ་བཞིན་དུ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ནས་དམ་པའི་ཆོས་ནུབ་པ་ན།
en: After he has passed into parinirvāṇa and his Dharma has come to an end, that realm will have the name Aparā.

source: འཇིག་རྟེན་གྱི་ཁམས་དེ་ནི་རྩིབས་ཞེས་བྱ་བར་འགྱུར་རོ། །དེ་ཡང་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིན་ཆེན་དབང་ཕྱུག་དབྱངས་ཞེས་བྱ་བ་འབྱུང་བར་འགྱུར་ཏེ། སངས་རྒྱས་ཀྱི་ཞིང་གི་ཡོན་ཏན་བཀོད་པ་ནི་མཚུངས་སོ།
en: That realm will have the same array of buddha-realm qualities, and in it will appear the tathāgata arhat samyaksam­buddha named Ratneśvaraghoṣa.

source: །དེ་ཡང་བར་གྱི་བསྐལ་པ་ལྔར་བཞུགས་ཏེ་འཚོ་ཞིང་གཞེས་ལ་ཆོས་ཀྱང་སྟོན་པར་འགྱུར་རོ།
en: He will reside, live, and remain for five intermediate eons and teach the Dharma.

source: །དེ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་ན། དེའི་དམ་པའི་ཆོས་ནི་བར་གྱི་བསྐལ་པ་བདུན་དུ་གནས་པར་འགྱུར་རོ། །དེར་དམ་པའི་ཆོས་ནུབ་པ་ན་སྔ་མ་བཞིན་སྦྱར་ཏེ།
en: When he has passed into parinirvāṇa, his Dharma will remain for seven intermediate eons, and when that Dharma has come to an end, there will successively occur what has been previously described.

source: སངས་རྒྱས་ཀྱི་ཞིང་དེར་དེ་བཞིན་གཤེགས་པ་ཚད་མེད་དཔག་ཏུ་མེད་པ་དག་བྱུང་ཞིང་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པར་མཐོང་ཡང་འཇིག་རྟེན་གྱི་ཁམས་དེ་ནི་འཇིག་པ་ཡང་མེད་འཆགས་པ་ཡང་མེད་དོ།
en: In that way, I see countless, innumerable tathāgata arhat samyaksam­buddhas appear and pass into parinirvāṇa in that realm without that realm being destroyed and recreated. “ ‘

source: །དེར་མ་འོངས་པའི་དུས་ཀྱི་བསྐལ་པ་གྲངས་མེད་པ་གང་གཱའི་ཀླུང་གཅིག་གི་བྱེ་མ་སྙེད་ནི་འདས། བསྐལ་པ་གྲངས་མེད་པ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་གཉིས་ལ་བབ་པ་ན་འཇིག་རྟེན་གྱི་ཁམས་དེ་ནི་བདེ་བ་ཅན་ཞེས་བྱ་བར་འགྱུར་ཏེ།
en: In the future, after one incalculable eon has passed, in which there are as many years as there are grains of sand in the Ganges River, and during a second such incalculable eon, in which there are as many years as there are grains of sand in the Ganges River, that realm will have the name Sukhāvatī.

source: རྒྱལ་པོ་ཆེན་པོ་ཁྱོད་དེར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་ཏེ།
en: Great king, you will attain the complete enlightenment of perfect buddhahood there.

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཚེ་དཔག་མེད་ཅེས་བྱ་བར་འགྱུར་རོ།
en: You will become the tathāgata arhat samyaksam­buddha named Amitāyus.’ “

source: །རྒྱལ་པོ་རྩིབས་ཀྱི་མུ་ཁྱུད་ཀྱིས་གསོལ་པ། བཙུན་པ་བཅོམ་ལྡན་འདས་གང་དག་འཇིག་རྟེན་གྱི་ཁམས་དེར་བདག་པས་ཆེས་སྔར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་བའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་གང་ནས་མཆིས་ལགས།
en: King Araṇemin asked, ‘Bhadanta Bhagavat, from where will the bodhisattva mahāsattvas come, who will be the first in that realm to attain the complete enlightenment of perfect buddhahood because of me?’ “ ‘

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རྒྱལ་པོ་ཆེན་པོ་གང་དག་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་ཚད་མེད་གྲངས་མེད། གཞལ་དུ་མེད། དཔག་ཏུ་མེད་པ་དེ་དང་དེ་དག་ནས། ང་ལ་ཕྱག་བྱ་བ་དང་།
en: Great king,’ replied the Bhagavat, ‘it will be these bodhisattva mahāsattvas who have come from innumerable, inconceivable, limitless realms in the ten directions to pay homage to me, honor me, and listen to the Dharma from me. “ ‘

source: བསྙེན་བཀུར་བྱ་བ་དང་། ཆོས་མཉན་པའི་ཕྱིར་དང་པོར་ལྷགས་ནས་གང་དག་ངའི་མདུན་ན་འཁོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འདི་དག་ཡིན་ཏེ། རིགས་ཀྱི་བུ་འདི་དག་ནི་འདས་པའི་སངས་རྒྱས་རྣམས་ཀྱིས་ཀྱང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་ཏོ། །འདི་དག་ནི་ད་ལྟར་བྱུང་བའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱིས་ཀྱང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་ཏེ།
en: Noble son, these bodhisattvas who are present before me have been prophesied by buddhas in the past to attain the highest, most complete enlightenment, and buddhas in the present have also prophesied that they will attain the highest, most complete enlightenment.

source: འདི་དག་ནི་སངས་རྒྱས་ཀྱི་ཞིང་དེར་དང་པོ་ཁོ་ནར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་རོ།
en: They are the ones who will be the first to attain the complete enlightenment of perfect buddhahood in your buddha realm.

source: །རྒྱལ་པོ་ཆེན་པོ་བྱང་ཆུབ་སེམས་དཔའ་འདི་དག་ནི་རེ་རེས་ཀྱང་སངས་རྒྱས་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་དུ་མ་དག་ལ་ལྷག་པར་བྱ་བ་བྱས་ཤིང་དགེ་བའི་རྩ་བ་བསྐྱེད་ལ་ཤེས་རབ་བསྒོམ་པ་ཡིན་ཏེ།
en: Great king, each of these bodhisattvas has performed great service to many hundreds of thousands of millions of trillions of buddhas, generating good roots and cultivating wisdom.

source: རྒྱལ་པོ་ཆེན་པོ་གང་དག་སངས་རྒྱས་ཀྱི་ཞིང་དེར་དང་པོ་ཁོ་ནར་སངས་རྒྱས་སུ་འགྱུར་བ་ནི་རིགས་ཀྱི་བུ་འདི་དག་ཡིན་ནོ། །རྒྱལ་པོ་རྩིབས་ཀྱི་མུ་ཁྱུད་ཀྱིས་གསོལ་པ།
en: Great king, it is these noble sons who will first attain buddhahood in your buddha realm.’ “

source: བཙུན་པ་བཅོམ་ལྡན་འདས་གང་གིས་བདག་འཁོར་དང་བཅས་པ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཡང་དག་པར་འཛིན་དུ་སྩལ་བའི་བྲམ་ཟེ་རྒྱ་མཚོའི་རྡུལ་དེ་དུས་ཅི་སྲིད་ཅིག་ན་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་ལགས།
en: King Araṇemin said, ‘Bhadanta Bhagavat, it is the brahmin Samudrareṇu who has caused me and my retinue to aspire to the highest, most complete enlightenment. When will he attain the complete enlightenment of perfect buddhahood?’ “ ‘

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རྒྱལ་པོ་ཆེན་པོ་བྲམ་ཟེ་རྒྱ་མཚོའི་རྡུལ་འདི་ནི་སྙིང་རྗེ་ཆེན་པོ་དང་ལྡན་པ་ཡིན་ཏེ།
en: Great king,’ replied the Bhagavat, ‘the brahmin Samudrareṇu has great compassion.

source: འདིས་ཇི་ལྟར་སེང་གེའི་སྒྲ་སྒྲོགས་པར་འགྱུར་བ་ན་ཁྱོད་ཀྱིས་ཀྱང་ཐོས་པར་འགྱུར་རོ།
en: You will hear his lion’s roar.’ “

source: །རྒྱལ་པོས་གསོལ་པ། གལ་ཏེ་བདག་ཅི་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ལུང་བསྟན་པ་དང་། བདག་གི་སྨོན་ལམ་དེ་གྲུབ་པ་ལྟ་ན། དེའི་སླད་དུ་གང་གི་ཚེ་བདག་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་ཡན་ལག་ལྔས་ཕྱག་བགྱིད་པ་དེའི་ཚེ་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་རབ་ཏུ་འགུལ་ཞིང་རབ་ཏུ་གཡོ་བར་གྱུར་ལ་སངས་རྒྱས་ཀྱི་ཞིང་དེ་དག་ན་སངས་རྒྱས་བཅོམ་ལྡན་འདས་གང་དག་བཞུགས་ཏེ། འཚོ་ཞིང་གཞེས་པ་དེ་དག་གིས་ཀྱང་བདག་ལ་ལུང་སྟོན་པར་གྱུར་ཅིག །
en: The king said, ‘If the Bhagavat’s prophecy and my prayer are to be fulfilled, then when I make homage with the five parts of my body at the Bhagavat’s feet, may realms as numerous as the grains of sand in the Ganges River shake and shudder, and may the bhagavat buddhas who reside, live, and remain in those buddha realms give me their prophecy.’ “

source: རིགས་ཀྱི་བུ་དེ་ནས་རྒྱལ་པོ་རྩིབས་ཀྱི་མུ་ཁྱུད་ཀྱིས་དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་སྙིང་པོའི་ཞབས་ལ་ཡན་ལག་ལྔས་གཏུགས་སོ། །གང་གི་ཚེ་རྒྱལ་པོའི་མགོ་བོ་ས་ལ་རེག་པ་དེའི་ཚེ། སངས་རྒྱས་ཀྱི་ཞིང་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་ཀྱང་འགུལ་རབ་ཏུ་འགུལ། གཡོས་རབ་ཏུ་གཡོས།
en: Then, noble son, King Araṇemin bowed down the five parts of his body to the feet of the Tathāgata Ratnagarbha.

source: འཁྲུགས་རབ་ཏུ་འཁྲུགས་ནས། སངས་རྒྱས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་ཀྱང་ལུང་སྟོན་པར་མཛད་དེ། བསྐལ་པ་འཛིན་པ་ཞེས་བྱ་བ་ལ་སངས་རྒྱས་ཀྱི་ཞིང་ཡང་དག་པར་སྒྲོལ་བ་ཞེས་བྱ་བར་སྐྱེ་དགུའི་ཚེ་ལོ་བརྒྱད་ཁྲི་ཐུབ་པ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིན་པོ་ཆེའི་སྙིང་པོའི་རྒྱལ་པོ་རྩིབས་ཀྱི་མུ་ཁྱུད་ལ་ཁྱོད་མ་འོངས་པའི་དུས་ན་བསྐལ་པ་གྲངས་མེད་པ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་འདས་ནས་བསྐལ་པ་གྲངས་མེད་པ་གཉིས་པ་ལ་བབ་པ་ན། འཇིག་རྟེན་གྱི་ཁམས་བདེ་བ་ཅན་ཞེས་བྱ་བ་དག་པ་དཔག་ཏུ་མེད་པར་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཚེ་དཔག་མེད་ཅེས་བྱ་བར་འགྱུར་ཏེ། ཕྱོགས་བཅུ་ཁོ་ར་ཁོར་ཡུག་ཏུ་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་ཀྱང་སྣང་བར་བྱེད་པར་འགྱུར་རོ་ཞེས་ལུང་བསྟན་ནས།
en: When the king’s head touched the ground, buddha realms as numerous as the grains of sand in the Ganges River shook, shook strongly, shuddered, shuddered strongly, quaked, and quaked strongly, and then buddhas as numerous as the grains of sand in the Ganges River made this prophecy: “ ‘In the Dhāraṇa eon, in the Saṃtīraṇa buddha realm, in which the lifespan of beings will be 80,000 years, the tathāgata arhat samyaksam­buddha Ratnagarbha made this prophecy to King Araṇemin: “After an incalculable eon has passed, in which there are as many years as there are grains of sand in the Ganges River, during a second such incalculable eon, there will be an immeasurably pure realm called Sukhāvatī in which King Araṇemin will become the tathāgata arhat samyaksam­buddha named Amitāyus, who will illuminate as many worlds in the ten directions as there are grains of sand in the Ganges River.” ’ “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། བྱ་བ་ཤེས་པའི་སེམས་ཅན་མཆོག་རབ་ལོངས།
en: The Bhagavat said: “ ‘Arise, supreme being who knows what is to be done.

source: །སྟོབས་བཅུ་གང་གཱ་སྙེད་ཀྱིས་ཁྱོད་ལུང་བསྟན། །རི་དང་བཅས་པའི་ས་ཡང་གཡོས་གྱུར་ཏེ།
en: You received a prophecy from those with the ten powers, Who are as numerous as the Ganges sands, and the earth and its mountains shook.

source: །མི་མཆོག་འདུལ་བའི་ཁ་ལོ་སྒྱུར་བར་འགྱུར།
en: Best of men, you will become the guide for those to be led.’ “

source: །རིགས་ཀྱི་བུ་དེ་ནས་རྒྱལ་པོ་རྩིབས་ཀྱི་མུ་ཁྱུད་དགའ་ཞིང་མགུ་ལ། རབ་ཏུ་དགའ་བ་དང་།
en: Then, noble son, King Araṇemin was joyful and happy, and he experienced supreme joy and bliss.

source: ཡིད་བདེ་བ་སྐྱེས་ནས་ཕྱིར་ནུར་ཏེ་ཆོས་མཉན་པའི་ཕྱིར་ཧ་ཅང་ཡང་མི་རིང་བར་ཕྱོགས་གཅིག་ཏུ་འདུག་གོ།
en: He then withdrew and sat to one side nearby in order to listen to the Dharma. “

source: །རིགས་ཀྱི་བུ་དེ་ནས་བྲམ་ཟེ་རྒྱ་མཚོའི་རྡུལ་གྱིས་རྒྱལ་པོ་རྩིབས་ཀྱི་མུ་ཁྱུད་ཀྱི་བུ་ཐུ་བོ་མིག་མི་འཛུམས་ལ་བོས་པ་དང་།
en: Then, noble son, the brahmin Samudrareṇu summoned King Araṇemin’s crown prince, Animiṣa.

source: མིག་མི་འཛུམས་ཀྱིས་གསོལ་པ་ཡང་སྔ་མ་བཞིན་དུ་སྦྱར་ཏེ།
en: Animiṣa asked the same questions as the king.

source: བཅོམ་ལྡན་འདས་བདག་གིས་ངན་སོང་རྣམས་ལ་བལྟས་ལགས་ན། སེམས་ཅན་གང་དག་དེར་སྐྱེས་པ་དེ་དག་ནི་སྡུག་བསྔལ་དྲག་པོ་རབ་ཏུ་མི་བཟད་པ་ཉམས་སུ་མྱོང་བར་འགྱུར་ལགས་སོ།
en: He said, ‘Bhagavat, I have seen the lower existences where beings experience extremely intense, unendurable suffering.

source: །བདག་གིས་མཐོ་རིས་རྣམས་སུ་བལྟས་ལགས་ན། སེམས་ཅན་གང་དག་དེར་སྐྱེས་པ་དེ་དག་ནི་ཀུན་ནས་ཉོན་མོངས་པར་འགྱུར་བའི་སེམས་ཀྱིས་སླར་ངན་སོང་རྣམས་སུ་ལྟུང་ལགས་སོ།
en: I have seen the upper realms, where beings have minds filled with kleśas and fall into the lower realms.

source: །བདག་གིས་སེམས་ཅན་ཐམས་ཅད་ལ་ཡང་བལྟས་ལགས་ན། མི་དགེ་བའི་བཤེས་གཉེན་དང་འདྲེས་པར་གནས་ཤིང་ཆོས་ཀྱི་མུ་གེའི་མུན་པ་ན་དགེ་བའི་རྩ་བ་ཡོངས་སུ་བས་པས་ལྟ་བའི་ཆུ་སྲིན་འཛིན་ཁྲིས་ཟིན་ཅིང་ཤུལ་ངན་པ་ན་གནས་པ་ལགས་ཏེ།
en: I have seen all beings associating with bad friends in the darkness of a famine of the Dharma, devoid of good roots, possessed by evil views, and following evil paths. “ ‘

source: བཅོམ་ལྡན་འདས་བདག་གིས་སེམས་ཅན་དེ་དག་ལ་ཚིག་གིས་རྒྱ་ཆེར་གོ་བར་བགྱི་ཞིང་།
en: Bhagavat, by voice I shall make these beings become aware.

source: དགེ་བའི་རྩ་བ་ཐམས་ཅད་ཀྱང་བདག་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོ་བར་བགྱི་ལགས་སོ། །གང་གི་ཚེ་བདག་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན་སེམས་ཅན་གང་དག་སྡུག་བསྔལ་གྱིས་གནོད་པར་གྱུར་པ་རྣམས་དང་། འཇིགས་པས་སྐྲག་པ་རྣམས་དང་། ཆོས་ཀྱི་མུ་གེའི་མུན་པར་ཞུགས་པ་རྣམས་དང་། ཞུམ་པ་རྣམས་དང་། ཞན་པ་རྣམས་དང་། སྐྱོབ་པ་མ་མཆིས་པ་རྣམས་དང་།
en: I will dedicate all good roots to the highest, most complete enlightenment.

source: སྐྱབས་མ་མཆིས་པ་རྣམས་དང་། དཔུང་གཉེན་མ་མཆིས་པ་རྣམས་ཀྱིས་བདག་རྗེས་སུ་དྲན་པར་འགྱུར་ཞིང་མིང་ནས་ཀྱང་རྗོད་པར་གྱུར་ཅིག །བདག་གིས་ཀྱང་ལྷའི་རྣ་བས་ཐོས་ཤིང་། ལྷའི་མིག་གིས་མཐོང་བར་གྱུར་ཅིག །སེམས་ཅན་དེ་དག་སྡུག་བསྔལ་དག་ལས་ཡོངས་སུ་ཐར་བར་མ་བགྱིས་པར་བདག་ཀྱང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་མི་རྒྱ་བར་གྱུར་ཅིག །
en: When I am performing bodhisattva conduct, may beings think of me and say my name when they are afflicted by suffering, frightened by terrors, in the darkness of the Dharma’s absence, despairing, weak, or with no protector, no refuge, and no resort, and may I never attain the complete enlightenment of perfect buddhahood unless I can hear them with my divine hearing, see them with my divine sight, and free them from their suffering. “ ‘

source: བཙུན་པ་བཅོམ་ལྡན་འདས་གང་གི་ཚེ་བདག་སྨོན་ལམ་གྱི་ཁྱད་པར་གྱིས་སེམས་ཅན་གྱི་སླད་དུ་ཡུན་རིང་པོར་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པར་འགྱུར་བ་དེའི་ཚེ་བདག་གི་རེ་བ་ཡོངས་སུ་རྫོགས་པར་གྱུར་ཅིག །
en: Bhadanta Bhagavat, when for a long time I practice bodhisattva conduct through this particular long-lasting prayer for the benefit of beings, may my wishes be fulfilled.

source: བཙུན་པ་བཅོམ་ལྡན་འདས་གང་གི་ཚེ་རྒྱལ་པོ་ཆེན་པོ་རྩིབས་ཀྱི་མུ་ཁྱུད་འདི་བསྐལ་པ་གྲངས་མ་མཆིས་པ་གང་གཱའི་ཀླུང་གཅིག་གི་བྱེ་མ་སྙེད་འདས་པ་ནས་གྲངས་མ་མཆིས་པ་གཉིས་པ་ལ་བབ་པ་ན་འཇིག་རྟེན་གྱི་ཁམས་བདེ་བ་ཅན་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་ཞིང་།
en: Bhadanta Bhagavat, after an incalculable eon has passed, in which there are as many years as there are grains of sand in the Ganges River, during a second such incalculable eon, King Araṇemin will become a tathāgata arhat samyaksam­buddha in the Sukhāvatī realm.

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཚེ་དཔག་མེད་ཅེས་བགྱི་བར་གྱུར་ནས། སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པ་ན་སེམས་ཅན་ཡོངས་སུ་དག་པ་རྣམས་ལ་སངས་རྒྱས་ཀྱི་མཛད་པ་མཛད་པར་འགྱུར་ཏེ།
en: When he has become the tathāgata arhat samyaksam­buddha Amitāyus, he will accomplish the deeds of a buddha for the pure beings in that completely pure realm.

source: དེ་བཞིན་གཤེགས་པ་ཚེ་དཔག་མེད་ཀྱིས་བསྐལ་པ་དཔག་ཏུ་མ་མཆིས་པ་ཇི་སྲིད་ཅིག་ཏུ་སངས་རྒྱས་ཀྱི་མཛད་པ་མཛད་ཅིང་།
en: The Tathāgata Amitāyus will perform the deeds of a buddha for countless eons.

source: སངས་རྒྱས་ཀྱི་མཛད་པ་ཡོངས་སུ་མཐར་ཐུག་ནས་ཕུང་པོའི་ལྷག་མ་མ་མཆིས་པའི་མྱ་ངན་ལས་འདས་པའི་དབྱིངས་སུ་འཇུག་པར་འགྱུར་ཞིང་།
en: When he has completed the deeds of a buddha, he will enter the state of nirvāṇa without any remaining aggregates. “ ‘

source: དེར་ཞུགས་ནས་ཀྱང་དམ་པའི་ཆོས་ཇི་སྲིད་དུ་གནས་པར་འགྱུར་བའི་ཡུན་དེ་སྲིད་དུ།
en: After he has entered parinirvāṇa, I will practice the conduct of a bodhisattva for as long as his Dharma remains.

source: བདག་གིས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་སྤྱད་པར་བགྱི་ཞིང་བདག་བྱང་ཆུབ་སེམས་དཔར་གྱུར་ནས་སངས་རྒྱས་ཀྱི་མཛད་པ་ཡང་བགྱི་ལགས་སོ།
en: As a bodhisattva, I will perform the deeds of a buddha.

source: །གང་གི་ཚེ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཚེ་དཔག་མེད་ཀྱི་དམ་པའི་ཆོས་ནམ་གྱི་སྲོད་ལ་ནུབ་པར་གྱུར་པ་དེ་ཉིད་ཀྱི་ནམ་གྱི་ཐོ་རངས་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་བགྱི་ན།
en: After the dusk when the Dharma of Samyaksam­buddha Amitāyus comes to an end, may I attain the complete enlightenment of perfect buddhahood at the following dawn. “ ‘

source: བཅོམ་ལྡན་འདས་ཀྱིས་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་དུ་གསོལ།
en: Bhagavat, I request that you prophesy my highest, most complete enlightenment.

source: དེ་བཞིན་དུ་བདག་གིས་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་ན། སངས་རྒྱས་བཅོམ་ལྡན་འདས་གང་དག་བཞུགས་ཏེ་འཚོ་ཞིང་གཞེས་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་ལ་ཡང་བདག་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་དུ་གསོལ་ཞེས་ཚིག་གིས་གསོལ་བ་གདབ་པར་བགྱི་ལགས་སོ།
en: Similarly, there are the bhagavat buddhas who reside, live, and remain in the ten directions, in worlds as numerous as the grains of sand in the Ganges River, and I request that those bhagavat buddhas also prophesy my attainment of the highest, most complete enlightenment.’ “

source: །རིགས་ཀྱི་བུ་དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་སྙིང་པོས་རྒྱལ་བུ་མིག་མི་འཛུམས་ལུང་བསྟན་ནས་འདི་སྐད་ཅེས་ཀྱང་བཀའ་སྩལ་ཏོ།
en: Those were the words of his request.

source: །རིགས་ཀྱི་བུ་གང་གི་ཕྱིར་ཁྱོད་ཀྱིས་ངན་སོང་རྣམས་སུ་ཡང་བལྟས། མཐོ་རིས་རྣམས་སུ་ཡང་བལྟས། སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྡུག་བསྔལ་ཡང་བལྟས་ཤིང་། སེམས་ཅན་ཐམས་ཅད་སྡུག་བསྔལ་ལས་ཐར་བར་བྱ་བ་དང་། ཉོན་མོངས་པ་རབ་ཏུ་ཞི་བར་བྱ་བའི་ཕྱིར་སྙིང་རྗེའི་སེམས་བསྐྱེད་པས་ན་རིགས་ཀྱི་བུ་དེའི་ཕྱིར་ཁྱོད་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་ཅེས་བྱའོ།
en: Noble son, the Tathāgata Ratnagarbha gave this prophecy to the crown prince Animiṣa: ‘Noble son, because the lower realms have been viewed by you, the higher realms have been viewed by you, and you have developed the compassion to free beings from suffering and to pacify their kleśas, it is for that reason, noble son, that you will be called Avalokiteśvara. “ ‘

source: །སྤྱན་རས་གཟིགས་དབང་ཕྱུག་ཁྱོད་ནི་སེམས་ཅན་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་མང་པོ་རྣམས་སྡུག་བསྔལ་ལས་ཐར་བར་བྱེད་པར་འགྱུར་ཏེ།
en: You, Avalokiteśvara, will free many hundreds of thousands of millions of trillions of beings from suffering.

source: རིགས་ཀྱི་བུ་ཁྱོད་ནི་བྱང་ཆུབ་སེམས་དཔར་གྱུར་པ་ན་ཡང་སངས་རྒྱས་ཀྱི་མཛད་པ་བྱེད་པར་འགྱུར་རོ།
en: Noble son, being a bodhisattva, you will accomplish the deeds of a buddha.

source: །རིགས་ཀྱི་བུ་ཁྱོད་ནི་དེ་བཞིན་གཤེགས་པ་འོད་དཔག་མེད་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ནས་བསྐལ་པ་གྲངས་མེད་པ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་གཉིས་པ་ལུས་པ་ན་ནམ་གང་གི་སྲོད་ལ་དམ་པའི་ཆོས་ནུབ་པར་གྱུར་པ་དེ་ཉིད་ཀྱི་ནམ་གྱི་ཐོ་རངས་བྱང་ཆུབ་ཀྱི་ཤིང་བཀོད་པ་དུ་མའི་དྲུང་དུ་རྡོ་རྗེའི་གདན་ལ་འདུག་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་ཏེ།
en: Noble son, after the Tathāgata Amitābha has passed into nirvāṇa, his Dharma will come to an end at dusk one day in the latter part of the second incalculable eon, in which there are as many years as there are grains of sand in the Ganges River. The following dawn you will attain the complete enlightenment of perfect buddhahood while sitting on a vajra seat, at a Bodhi tree, in a manifold array.

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་ཟེར་ཀུན་ནས་འཕགས་པ་དཔལ་བརྩེགས་རྒྱལ་པོ་ཞེས་བྱ་བར་འགྱུར་རོ།
en: You will become the tathāgata arhat samyaksam­buddha named Saman­taraśmya­bhyudgataśrīkūṭa­rāja.

source: །ཁྱོད་ཀྱི་ཚེའི་ཚད་ནི་བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་དགུ་བཅུ་རྩ་དྲུག་ཏུ་འགྱུར་རོ།
en: Your lifespan will be ninety-six hundred thousand million trillion eons.

source: །ཁྱོད་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ནས་ཀྱང་དམ་པའི་ཆོས་ནི་བསྐལ་པ་དུང་ཕྱུར་ཕྲག་དྲུག་དང་བྱེ་བ་ཕྲག་གསུམ་དུ་གནས་པར་འགྱུར་རོ།
en: After you have passed into parinirvāṇa your Dharma will continue for 630,000,000 eons.’ “

source: །སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གིས་གསོལ་པ། བཅོམ་ལྡན་འདས་གལ་ཏེ་བདག་གི་རེ་བ་འདི་ལྟ་བུ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་བ་ལྟ་ན། དེའི་སླད་དུ་གང་གི་ཚེ་བདག་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་ཕྱག་འཚལ་བ་དེའི་ཚེ། ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་ན་སངས་རྒྱས་བཅོམ་ལྡན་འདས་གང་དག་བཞུགས་ཏེ། འཚོ་ཞིང་གཞེས་པ་དེ་དག་གིས་བདག་ལ་ལུང་སྟོན་པར་མཛད་ཅིང་།
en: Avalokiteśvara asked, ‘Bhagavat, if these wishes of mine are to be fulfilled, then when I bow down to the Bhagavat’s feet, may the bhagavat buddhas, who reside, live, and remain within worlds in the ten directions that are as numerous as the grains of sand in the Ganges River, give me their prophecy.

source: ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་པོ་ཐམས་ཅད་ཀྱི་ས་ཡང་གཡོ་བར་གྱུར་ལ། རི་ཐམས་ཅད་ཀྱི་གོར་མ་དང་། ཤིང་ལྗོན་པའི་རྩེ་མོ་དག་ལས་ཀྱང་ཡན་ལག་ལྔ་དང་ལྡན་པའི་སིལ་སྙན་གྱི་སྒྲ་ཡང་འབྱུང་བར་གྱུར་ཅིག །སེམས་ཅན་ཐམས་ཅད་ཀྱིས་ཀྱང་འདོད་ཆགས་དང་བྲལ་བའི་སེམས་ཐོབ་པར་གྱུར་ཅིག །
en: May the ground shake in worlds in the ten directions that are as numerous as the grains of sand in the Ganges River; may there come music that has the five tempos from the stones and treetops of all mountains; and may all beings have minds free of desire.’ “

source: གང་གི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་ཕྱུག་གིས་དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་སྙིང་པོའི་ཞབས་ལ་ཡན་ལག་ལྔས་ཕྱག་བྱས་པ་དེའི་ཚེ་སྔ་མ་བཞིན་དུ་སྦྱར་ཏེ།
en: When the bodhisattva Avalokiteśvara bowed down the five points of his body to the feet of the Tathāgata Ratnagarbha, the same happened as just described.

source: སངས་རྒྱས་ཀྱི་ཞིང་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་གིས་ཡང་རབ་ཏུ་གཡོས། སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་ཀྱང་ལུང་སྟོན་པར་མཛད།
en: The ground in buddha realms as numerous as the grains of sand in the Ganges River shook strongly, and those bhagavat buddhas gave their prophecy.

source: རི་ཐམས་ཅད་ཀྱི་རྡོ་དང་། ཤིང་ལྗོན་པའི་རྩེ་མོ་དག་ལས་ཀྱང་ཡན་ལག་ལྔ་དང་ལྡན་པའི་སིལ་སྙན་གྱི་སྒྲ་བྱུང་བར་གྱུར། སེམས་ཅན་ཐམས་ཅད་ཀྱང་འདོད་ཆགས་དང་བྲལ་བའི་སེམས་ལ་གནས་པར་གྱུར་པ་དང་།
en: There came the sound of music from the from the stones and treetops of all mountains, and all beings were in a mental state free from desire. “
